create table if not exists Клиенты (
	ID_клиента serial primary key,
	Имя varchar(100) not null,
	Фамилия varchar(100) not null,
	Email varchar(100)
);

create table if not exists Заказы (
	ID_заказа serial primary key,
	ID_клиента serial references Клиенты (ID_клиента)
	Дата_заказа timestamp,
	Общая_стоимость_заказа money
);

create table if not exists Товары (
	ID_товара serial primary key,
	Наименование_товара varchar(255) not null
);

create table if not exists Детальная_информация_заказов (
	ID_детальной_инофрмации_заказа serial primary key,
	ID_заказа serial references Заказы (ID_заказа),
	ID_товара serial references Товары (ID_товара),
	Количество_товаров_в_заказе int,
	Цена_за_единицу_товара money
);


INSERT INTO Товары (Наименование_товара) 
VALUES 
	('Хлеб'),
    ('Масло'),
    ('Молоко'),
    ('Яйца'),
    ('Сахар'),
    ('Соль'),
    ('Мука'),
    ('Кофе'),
    ('Чай'),
    ('Рис'),
    ('Гречка'),
    ('Картошка'),
    ('Томаты'),
    ('Огурцы'),
    ('Мясо'),
    ('Рыба'),
    ('Сыр'),
    ('Кефир'),
    ('Йогурт'),
    ('Сок');

INSERT INTO Клиенты (Имя, Фамилия, Email) 
VALUES 
    ('Иван', 'Иванов', 'ivan@gmail.com'),
    ('Мария', 'Петрова', 'maria@yandex.ru'),
    ('Александр', 'Сидоров', 'alex@mail.ru'),
    ('Екатерина', 'Смирнова', 'ekaterina@gmail.com'),
    ('Дмитрий', 'Козлов', 'dmitry@yandex.ru'),
    ('Анна', 'Морозова', 'anna@mail.ru'),
    ('Сергей', 'Новиков', 'sergei@gmail.com'),
    ('Ольга', 'Павлова', 'olga@yandex.ru'),
    ('Артем', 'Васнецов', 'artem@mail.ru'),
    ('Елена', 'Кузнецова', 'elena@gmail.com'),
    ('Максим', 'Макаров', 'maxim@yandex.ru'),
    ('Татьяна', 'Орлова', 'tatyana@mail.ru'),
    ('Игорь', 'Белов', 'igor@gmail.com'),
    ('Юлия', 'Захарова', 'yulia@yandex.ru'),
    ('Павел', 'Богданов', 'pavel@mail.ru'),
    ('Наталья', 'Шарова', 'natalia@gmail.com'),
    ('Владимир', 'Григорьев', 'vladimir@yandex.ru'),
    ('Олеся', 'Исакова', 'olesya@mail.ru'),
    ('Роман', 'Куликов', 'roman@gmail.com'),
    ('Алина', 'Беляева', 'alina@yandex.ru'),
    ('Егор', 'Гайдар', 'egorg@gmail.com');

INSERT INTO Заказы (ID_клиента, Дата_заказа, Общая_стоимость_заказа) 
VALUES 
    (1, '2023-11-25 10:00:00', 700.00),
    (2, '2023-11-25 10:15:00', 850.00),
    (3, '2023-11-25 10:30:00', 1200.00),
    (3, '2023-11-25 11:00:00', 530.00),
    (3, '2023-11-25 11:30:00', 670.00),
    (3, '2023-11-25 12:00:00', 890.00),
    (4, '2023-11-25 12:30:00', 590.00),
    (4, '2023-11-25 13:00:00', 720.00),
    (5, '2023-11-25 13:30:00', 980.00),
    (5, '2023-11-25 14:00:00', 1200.00),
    (5, '2023-11-25 14:30:00', 1600.00),
    (6, '2023-11-25 15:00:00', 1900.00),
    (6, '2023-11-25 15:30:00', 550.00),
    (7, '2023-11-25 16:00:00', 720.00),
    (7, '2023-11-25 16:30:00', 890.00),
    (8, '2023-11-25 17:00:00', 1050.00),
    (8, '2023-11-25 17:30:00', 1170.00),
    (9, '2023-11-25 18:00:00', 1320.00),
    (9, '2023-11-25 18:30:00', 1470.00),
    (10, '2023-11-25 19:00:00', 1600.00),
    (10, '2023-11-25 19:30:00', 1750.00),
    (11, '2023-11-25 20:00:00', 1850.00),
    (12, '2023-11-25 20:30:00', 1950.00),
    (12, '2023-11-25 21:00:00', 2000.00),
    (13, '2023-11-25 21:30:00', 1200.00),
    (13, '2023-11-25 22:00:00', 1350.00),
    (14, '2023-11-25 22:30:00', 1500.00),
    (14, '2023-11-25 23:00:00', 1650.00),
    (14, '2023-11-25 23:30:00', 1800.00),
    (15, '2023-11-26 00:00:00', 1900.00),
    (15, '2023-11-26 00:30:00', 500.00),
    (16, '2023-11-26 01:00:00', 850.00),
    (16, '2023-11-26 01:30:00', 1100.00),
    (16, '2023-11-26 02:00:00', 1250.00),
    (17, '2023-11-26 02:30:00', 1400.00),
    (17, '2023-11-26 03:00:00', 1500.00),
    (18, '2023-11-26 03:30:00', 1700.00),
    (18, '2023-11-26 04:00:00', 1850.00),
    (19, '2023-11-26 04:30:00', 2000.00),
    (19, '2023-11-26 05:00:00', 1300.00),
    (20, '2023-11-26 05:30:00', 900.00);

INSERT INTO Детальная_информация_заказов (ID_заказа, ID_товара, Количество_товаров_в_заказе, Цена_за_единицу_товара)
VALUES 
    (1, 1, 10, 70.00),
    (2, 2, 20, 42.50),
    (3, 3, 2, 600.00),
    (4, 4, 10, 53.00),
    (5, 5, 10, 67.00),
    (6, 6, 10, 89.00),
    (7, 7, 100, 5.90),
    (8, 8, 10, 72.00),
    (9, 9, 14, 70.00),
    (10, 10, 2, 600.00),
    (11, 11, 100, 16.00),
    (12, 12, 100, 19.00),
    (13, 13, 10, 55.00),
    (14, 14, 10, 72.00),
    (15, 15, 10, 89.00),
    (16, 16, 42, 25.00),
    (17, 17, 10, 117.00),
    (18, 18, 10, 132.00),
    (19, 19, 7, 210.00),
    (20, 20, 2, 800.00),
    (21, 1, 25, 70.00),
    (22, 2, 50, 37.00),
    (23, 3, 8, 243.75),
    (24, 4, 2, 1000.00),
    (25, 5, 2, 600.00),
    (26, 6, 8, 168.75),
    (27, 7, 16, 93.75),
    (28, 8, 10, 165.00),
    (29, 9, 100, 18.00),
    (30, 10, 25, 76.00),
    (31, 11, 100, 5.00),
    (32, 12, 250, 3.40),
    (33, 13, 8, 137.50),
    (34, 14, 50, 25.00),
    (35, 15, 64, 21.875),
    (36, 16, 100, 15.00),
    (37, 17, 100, 17.00),
    (38, 18, 100, 18.50),
    (39, 19, 100, 20.00),
    (40, 20, 16, 8.125),
    (41, 1, 1000, 0.90);



SELECT
    Клиенты.Имя,
    Клиенты.Фамилия,
    SUM(Заказы.Общая_стоимость_заказа) AS Суммарная_стоимость_заказов,
    AVG(Заказы.Общая_стоимость_заказа::NUMERIC) AS Средняя_суммарная_стоимость_заказов
FROM
    Клиенты
INNER JOIN Заказы ON Клиенты.ID_клиента = Заказы.ID_клиента
GROUP BY
    Клиенты.ID_клиента, Клиенты.Имя, Клиенты.Фамилия
ORDER BY
    Суммарная_стоимость_заказов DESC;



SELECT
    Клиенты.Имя,
    Клиенты.Фамилия,
    SUM(Заказы.Общая_стоимость_заказа) AS Суммарная_стоимость_заказов
FROM
    Клиенты
JOIN Заказы ON Клиенты.ID_клиента = Заказы.ID_клиента
GROUP BY
    Клиенты.ID_клиента, Клиенты.Имя, Клиенты.Фамилия
HAVING SUM(Заказы.Общая_стоимость_заказа) = (
    SELECT MAX(Суммарная_стоимость_заказов)
    FROM (
            SELECT Клиенты.ID_клиента, SUM(Заказы.Общая_стоимость_заказа) AS Суммарная_стоимость_заказов
            FROM Клиенты
            JOIN Заказы ON Клиенты.ID_клиента = Заказы.ID_клиента
            GROUP BY Клиенты.ID_клиента
    ) AS Суммарная_стоимость_заказов
);



SELECT
    Клиенты.Имя,
    Клиенты.Фамилия,
    Заказы.ID_заказа,
    Заказы.Общая_стоимость_заказа
FROM
    Клиенты
JOIN Заказы ON Клиенты.ID_клиента = Заказы.ID_клиента
WHERE Клиенты.ID_клиента = (
    SELECT Заказы.ID_клиента 
    FROM 
        Заказы 
    GROUP BY 
        Заказы.ID_клиента
    HAVING SUM(Заказы.Общая_стоимость_заказа) = (
        SELECT MAX(Суммарная_стоимость_заказов)
        FROM (
                SELECT SUM(Заказы.Общая_стоимость_заказа) AS Суммарная_стоимость_заказов
                FROM Заказы
                GROUP BY Заказы.ID_клиента
        )
    )
)
ORDER BY Заказы.Общая_стоимость_заказа ASC;



SELECT
    Клиенты.Имя,
    Клиенты.Фамилия,
    SUM(Заказы.Общая_стоимость_заказа) AS Суммарная_стоимость_заказов,
    AVG(Заказы.Общая_стоимость_заказа::NUMERIC) AS Средняя_суммарная_стоимость_заказов,
    (SELECT AVG(Заказы.Общая_стоимость_заказа::NUMERIC) FROM Заказы) AS Сред_сумм_стоимость_заказа_по_всем_клиентам
FROM
    Клиенты
JOIN Заказы ON Клиенты.ID_клиента = Заказы.ID_клиента
GROUP BY 
    Клиенты.ID_клиента, Клиенты.Имя, Клиенты.Фамилия
HAVING SUM(Заказы.Общая_стоимость_заказа::NUMERIC) > (
    SELECT AVG(Заказы.Общая_стоимость_заказа::NUMERIC)
    FROM 
        Заказы
)
ORDER BY Суммарная_стоимость_заказов;
